ERP.belugaerp/src/Documents/битСписаниеПотерь/битСписаниеПотерь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битСписаниеПотерь</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>МесяцСписания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСписаниеПоНорме</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовСписаниеСверхНормы</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеховаяКладовая</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроляОстатков</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиТоваров</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКонтроль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФактическиеПотери</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопустимыеПотери</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеПотерь</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоНорме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСверхНормы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СтатусыДвиженияПродукцииИМатериалов/СтатусыДвиженияПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДвиженияПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Принято</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ВариантыПриемкиТоваров/ВариантыПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыПриемкиТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>РазделенаТолькоПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СтатусыВнутреннихПотреблений/СтатусыВнутреннихПотреблений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыВнутреннихПотреблений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Отгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/ДвижениеПродукцииИМатериалов/ДвижениеПродукцииИМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДвижениеПродукцииИМатериалов</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_СписаниеПотерь</name>
    <type>
      <types>DocumentRef.битСписаниеПотерь</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_ДанныеФСМ</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецДиапазона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Documents/битСписаниеПотерь/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура бг_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	МесяцСписания = НачалоМесяца(ТекущаяДатаСеанса());
	ДатаКонтроляОстатков = ТекущаяДатаСеанса();
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура бг_ОбработкаПроведения(Отказ, РежимПроведения)
	ПараметрыПроведенияДокумента = ОпределитьПараметрыПроведения();
	СоздатьДокументыСписания(Отказ, ПараметрыПроведенияДокумента);
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура бг_ОбработкаУдаленияПроведения(Отказ)
	ОтменитьУдалитьДокументы(Отказ, Документы.битСписаниеПотерь.ДокументыСписания(Ссылка));
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьПараметрыПроведения()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	битСписаниеПотерь.СтатьяРасходовСписаниеПоНорме КАК СтатьяРасходовСписаниеПоНорме,
	|	битСписаниеПотерь.СтатьяРасходовСписаниеСверхНормы КАК СтатьяРасходовСписаниеСверхНормы,
	|	битСписаниеПотерь.Организация КАК Организация,
	|	битСписаниеПотерь.Склад КАК Склад,
	|	битСписаниеПотерь.ЦеховаяКладовая КАК ЦеховаяКладовая,
	|	битСписаниеПотерь.Подразделение КАК Подразделение,
	|	битСписаниеПотерь.Ссылка КАК Ссылка,
	|	битСписаниеПотерь.МесяцСписания КАК МесяцСписания,
	|	битСписаниеПотерь.Склад.КонтролироватьСвободныеОстатки КАК КонтролироватьСвободныеОстатки
	|ИЗ
	|	Документ.битСписаниеПотерь КАК битСписаниеПотерь
	|ГДЕ
	|	битСписаниеПотерь.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	битСписаниеПотерьОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	битСписаниеПотерьОстаткиТоваров.Серия КАК Серия,
	|	битСписаниеПотерьОстаткиТоваров.Количество КАК Количество
	|ИЗ
	|	Документ.битСписаниеПотерь.ОстаткиТоваров КАК битСписаниеПотерьОстаткиТоваров
	|ГДЕ
	|	битСписаниеПотерьОстаткиТоваров.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	битСписаниеПотерьРаспределениеПотерь.Номенклатура КАК Номенклатура,
	|	битСписаниеПотерьРаспределениеПотерь.Серия КАК Серия,
	|	битСписаниеПотерьРаспределениеПотерь.Изделие КАК Изделие,
	|	битСписаниеПотерьРаспределениеПотерь.КоличествоПоНорме КАК Количество,
	|	битСписаниеПотерьРаспределениеПотерь.КоличествоСверхНормы КАК КоличествоСверхНормы
	|ИЗ
	|	Документ.битСписаниеПотерь.РаспределениеПотерь КАК битСписаниеПотерьРаспределениеПотерь
	|ГДЕ
	|	битСписаниеПотерьРаспределениеПотерь.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнутреннийЗапрос.Номенклатура КАК Номенклатура,
	|	ВнутреннийЗапрос.Серия КАК Серия,
	|	СУММА(ВнутреннийЗапрос.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		битСписаниеПотерьОстаткиТоваров.Номенклатура КАК Номенклатура,
	|		битСписаниеПотерьОстаткиТоваров.Серия КАК Серия,
	|		битСписаниеПотерьОстаткиТоваров.Количество КАК Количество
	|	ИЗ
	|		Документ.битСписаниеПотерь.ОстаткиТоваров КАК битСписаниеПотерьОстаткиТоваров
	|	ГДЕ
	|		битСписаниеПотерьОстаткиТоваров.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		битСписаниеПотерьРаспределениеПотерь.Номенклатура,
	|		битСписаниеПотерьРаспределениеПотерь.Серия,
	|		-битСписаниеПотерьРаспределениеПотерь.КоличествоПоНорме - битСписаниеПотерьРаспределениеПотерь.КоличествоСверхНормы
	|	ИЗ
	|		Документ.битСписаниеПотерь.РаспределениеПотерь КАК битСписаниеПотерьРаспределениеПотерь
	|	ГДЕ
	|		битСписаниеПотерьРаспределениеПотерь.Ссылка = &Ссылка) КАК ВнутреннийЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВнутреннийЗапрос.Номенклатура,
	|	ВнутреннийЗапрос.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка,
	|	ДвижениеПродукцииИМатериалов.Проведен КАК Проведен,
	|	ДвижениеПродукцииИМатериалов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.бг_СписаниеПотерь = &Ссылка
	|	И ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДвижениеПродукцииИМатериалов.Ссылка КАК Ссылка,
	|	ДвижениеПродукцииИМатериалов.Проведен КАК Проведен,
	|	ДвижениеПродукцииИМатериалов.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ДвижениеПродукцииИМатериалов КАК ДвижениеПродукцииИМатериалов
	|ГДЕ
	|	ДвижениеПродукцииИМатериалов.бг_СписаниеПотерь = &Ссылка
	|	И ДвижениеПродукцииИМатериалов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаМатериаловВКладовую)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВнутреннееПотреблениеТоваров.Ссылка КАК Ссылка,
	|	ВнутреннееПотреблениеТоваров.Проведен КАК Проведен,
	|	ВнутреннееПотреблениеТоваров.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.ВнутреннееПотреблениеТоваров КАК ВнутреннееПотреблениеТоваров
	|ГДЕ
	|	ВнутреннееПотреблениеТоваров.бг_СписаниеПотерь = &Ссылка";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	тзШапка = РезультатЗапроса[0].Выгрузить();
	Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(тзШапка[0]);
	Результат.Вставить("РезультатЗапросаОстатки", РезультатЗапроса[1]);
	Результат.Вставить("РезультатЗапросаПотери", РезультатЗапроса[2]);
	Результат.Вставить("РезультатЗапросаВозврат", РезультатЗапроса[3]);
	Результат.Вставить("ДокументыВозвратИзКладовой", РезультатЗапроса[4].Выгрузить());
	Результат.Вставить("ДокументыПередачаВКладовую", РезультатЗапроса[5].Выгрузить());
	Результат.Вставить("ДокументыСписания", РезультатЗапроса[6].Выгрузить());
	Возврат Результат;
КонецФункции

Процедура СоздатьДокументыСписания(Отказ, ПараметрыПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрыПроведения.КонтролироватьСвободныеОстатки Тогда
		УстановитьПризнакКонтроляСвободныхОстатков(ПараметрыПроведения.ЦеховаяКладовая, Ложь);
	КонецЕсли;
	ИзменятьПараметрСеанса = Не ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций;
	Если ИзменятьПараметрСеанса Тогда
		ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Истина;
	КонецЕсли;
	ОтменитьУдалитьДокументы(Отказ, ПараметрыПроведения.ДокументыПередачаВКладовую);
	ОтменитьУдалитьДокументы(Отказ, ПараметрыПроведения.ДокументыСписания);
	ОтменитьУдалитьДокументы(Отказ, ПараметрыПроведения.ДокументыВозвратИзКладовой);
	СоздатьДокументВозвратИзКладовой(Отказ, ПараметрыПроведения);
	СоздатьДокументПотери(Отказ, ПараметрыПроведения);
	СоздатьДокументПередачаВКладовую(Отказ, ПараметрыПроведения);
	Если ПараметрыПроведения.КонтролироватьСвободныеОстатки Тогда
		УстановитьПризнакКонтроляСвободныхОстатков(ПараметрыПроведения.ЦеховаяКладовая, Истина);
	КонецЕсли;
	Если ИзменятьПараметрСеанса Тогда
		ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура СоздатьДокументВозвратИзКладовой(Отказ, ПараметрыПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ДокументОбъект = ОпределитьСоздатьДокументОбъект(ПараметрыПроведения.ДокументыВозвратИзКладовой, "ДвижениеПродукцииИМатериалов");
	ДокументОбъект.Организация = ПараметрыПроведения.Организация;
	ДокументОбъект.Дата = КонецМесяца(ПараметрыПроведения.МесяцСписания);
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратМатериаловИзКладовой;
	ДокументОбъект.Отправитель = ПараметрыПроведения.ЦеховаяКладовая;
	ДокументОбъект.Получатель = ПараметрыПроведения.Склад;
	ДокументОбъект.бг_СписаниеПотерь = ПараметрыПроведения.Ссылка;
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОбъект.Комментарий = СтрШаблон(НСтр("ru='Списание потерь %1'"), Формат(ПараметрыПроведения.МесяцСписания, "ДФ='ММММ гггг'")); 
	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ДокументОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ДокументОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументОбъект.Товары.Очистить();
	Выборка = ПараметрыПроведения.РезультатЗапросаОстатки.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
	КонецЦикла;
	Если ДокументОбъект.Товары.Количество() = 0 Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ДвижениеПродукцииИМатериалов);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);	
	ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольТоваровОрганизацийПоДокументу");
	ДокументОбъект.Записать(РежимЗаписи);
КонецПроцедуры

Процедура СоздатьДокументПотери(Отказ, ПараметрыПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ДокументОбъект = ОпределитьСоздатьДокументОбъект(ПараметрыПроведения.ДокументыСписания, "ВнутреннееПотреблениеТоваров");
	ДокументОбъект.Организация = ПараметрыПроведения.Организация;
	ДокументОбъект.Дата = КонецМесяца(ПараметрыПроведения.МесяцСписания);
	ДокументОбъект.Подразделение = ПараметрыПроведения.Подразделение;
	ДокументОбъект.Склад = ПараметрыПроведения.Склад;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;
	ДокументОбъект.Статус = Перечисления.СтатусыВнутреннихПотреблений.Отгружено;
	ДокументОбъект.бг_СписаниеПотерь = ПараметрыПроведения.Ссылка;
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОбъект.Комментарий = СтрШаблон(НСтр("ru='Списание потерь %1'"), Формат(ПараметрыПроведения.МесяцСписания, "ДФ='ММММ гггг'")); 
	ДокументОбъект.Товары.Очистить();
	Выборка = ПараметрыПроведения.РезультатЗапросаПотери.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			НоваяСтрока.СтатьяРасходов = ПараметрыПроведения.СтатьяРасходовСписаниеПоНорме;
			НоваяСтрока.АналитикаРасходов = Выборка.Изделие;
		КонецЕсли;
		Если Выборка.КоличествоСверхНормы > 0 Тогда
			НоваяСтрока = ДокументОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Количество = Выборка.КоличествоСверхНормы;
			НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
			НоваяСтрока.СтатьяРасходов = ПараметрыПроведения.СтатьяРасходовСписаниеСверхНормы;
		КонецЕсли;
		
	КонецЦикла;
	Если ДокументОбъект.Товары.Количество() = 0 Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ВнутреннееПотреблениеТоваров);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);	                             
	ДокументОбъект.Записать(РежимЗаписи);
КонецПроцедуры

Процедура СоздатьДокументПередачаВКладовую(Отказ, ПараметрыПроведения)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ДокументОбъект = ОпределитьСоздатьДокументОбъект(ПараметрыПроведения.ДокументыПередачаВКладовую, "ДвижениеПродукцииИМатериалов");
	ДокументОбъект.Организация = ПараметрыПроведения.Организация;
	ДокументОбъект.Дата = КонецМесяца(ПараметрыПроведения.МесяцСписания) + 1;
	ДокументОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;
	ДокументОбъект.Отправитель = ПараметрыПроведения.Склад;
	ДокументОбъект.Получатель = ПараметрыПроведения.ЦеховаяКладовая;
	ДокументОбъект.бг_СписаниеПотерь = ПараметрыПроведения.Ссылка;
	ДокументОбъект.Ответственный = Пользователи.ТекущийПользователь();
	ДокументОбъект.Комментарий = СтрШаблон(НСтр("ru='Списание потерь %1'"), Формат(ПараметрыПроведения.МесяцСписания, "ДФ='ММММ гггг'")); 
	ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументОбъект.Статус = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;
	ДокументОбъект.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ДокументОбъект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	ДокументОбъект.Товары.Очистить();
	Выборка = ПараметрыПроведения.РезультатЗапросаВозврат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = ДокументОбъект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
	КонецЦикла;
	Если ДокументОбъект.Товары.Количество() = 0 Тогда
		РежимЗаписи = РежимЗаписиДокумента.Запись;
	Иначе
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ДокументОбъект, Документы.ДвижениеПродукцииИМатериалов);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ДокументОбъект, ПараметрыУказанияСерий);	
	ДокументОбъект.Записать(РежимЗаписи);
КонецПроцедуры

Функция ОпределитьСоздатьДокументОбъект(ТаблицаДокументов, ИмяДокумента)
	Если ТаблицаДокументов.Количество() > 0 Тогда
		СтрокаДокумент = ТаблицаДокументов[0];
		Результат = СтрокаДокумент.Ссылка.ПолучитьОбъект();
		Результат.ПометкаУдаления = Ложь;
	Иначе
		Результат = Документы[ИмяДокумента].СоздатьДокумент();
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ОтменитьУдалитьДокументы(Отказ, ТаблицаДокументов)
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	мДокументы = ТаблицаДокументов.НайтиСтроки(Новый Структура("ПометкаУдаления", Ложь));
	Для каждого СтрокаДокумент Из мДокументы Цикл
		ДокументОбъект = СтрокаДокумент.Ссылка.ПолучитьОбъект();
		РежимЗаписи = ?(СтрокаДокумент.Проведен, РежимЗаписиДокумента.ОтменаПроведения, РежимЗаписиДокумента.Запись);
		ДокументОбъект.ПометкаУдаления = Истина;
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольТоваровОрганизацийПоДокументу");
		ДокументОбъект.Записать(РежимЗаписи);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьПризнакКонтроляСвободныхОстатков(СкладСсылка, Признак)
	СкладОбъект = СкладСсылка.ПолучитьОбъект();
	СкладОбъект.КонтролироватьСвободныеОстатки = Признак;
	СкладОбъект.ДополнительныеСвойства.Вставить("адаптер_ЭтоЗагрузкаДанных");
	СкладОбъект.Записать();
КонецПроцедуры

#КонецОбласти
